{"class_name": "Tokenizer", "config": {"num_words": 107, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 2000, "word_counts": "{\"recvfrom\": 2206658, \"futex\": 13218743, \"clock\": 40598367, \"gettime\": 40585973, \"ppoll\": 427065, \"epoll\": 3040653, \"pwait\": 2978200, \"ioctl\": 3156527, \"restart\": 30693, \"syscall\": 30693, \"read\": 13322942, \"rt\": 17869601, \"sigtimedwait\": 7941, \"madvise\": 626569, \"mmap2\": 9398910, \"write\": 5690023, \"getuid32\": 1178022, \"writev\": 233552, \"openat\": 783652, \"gettid\": 10740523, \"sigaltstack\": 55815, \"munmap\": 9054051, \"sigprocmask\": 17751445, \"exit\": 25149, \"faccessat\": 191570, \"gettimeofday\": 5015576, \"sendto\": 772204, \"fcntl64\": 1148923, \"fstat64\": 926544, \"close\": 2598358, \"dup\": 464767, \"prctl\": 912081, \"getrandom\": 88479, \"pread64\": 278944, \"ctl\": 58395, \"sched\": 2365126, \"yield\": 2331488, \"fstatat64\": 783165, \"mprotect\": 594842, \"clone\": 32448, \"set\": 51832, \"tid\": 20928, \"address\": 20928, \"thread\": 30904, \"area\": 30904, \"getpriority\": 77084, \"setpriority\": 24289, \"uname\": 62807, \"membarrier\": 61974, \"readlinkat\": 93408, \"getsockopt\": 124796, \"eventfd2\": 3947, \"create1\": 4058, \"renameat\": 17531, \"fsync\": 11941, \"fchmodat\": 19842, \"unlinkat\": 19554, \"recvmsg\": 285403, \"sendmsg\": 112696, \"timerfd\": 9213, \"settime\": 8614, \"socket\": 61865, \"connect\": 51265, \"getsockname\": 12526, \"pwrite64\": 268380, \"setsockopt\": 13358, \"ftruncate64\": 48858, \"mkdirat\": 17345, \"pipe2\": 7206, \"nanosleep\": 1752723, \"fdatasync\": 74391, \"statfs64\": 4627, \"geteuid32\": 23687, \"getgid32\": 1784, \"getegid32\": 1791, \"socketpair\": 5475, \"getdents64\": 22649, \"create\": 612, \"llseek\": 644574, \"mremap\": 15747, \"ugetrlimit\": 730, \"lseek\": 48135, \"flock\": 4370, \"getscheduler\": 14833, \"getparam\": 13607, \"process\": 2637689, \"vm\": 2637689, \"readv\": 2637701, \"sigaction\": 45174, \"tgkill\": 11519, \"sigreturn\": 14525, \"getpid\": 51654, \"dup3\": 7915, \"capget\": 290, \"execve\": 3135, \"personality\": 2478, \"fstatfs64\": 13871, \"getaffinity\": 1212, \"setsid\": 288, \"getppid\": 909, \"setitimer\": 540, \"ptrace\": 17025, \"group\": 1455, \"shutdown\": 4418, \"kill\": 199, \"setaffinity\": 3359, \"sigsuspend\": 2295, \"getpeername\": 378, \"fchmod\": 399, \"wait4\": 1719, \"setpgid\": 16, \"sysinfo\": 8554, \"bind\": 6661, \"listen\": 177, \"accept4\": 3184, \"mincore\": 903, \"inotify\": 333, \"init1\": 17, \"fchown32\": 6400, \"get\": 495, \"priority\": 495, \"min\": 245, \"max\": 250, \"setscheduler\": 87, \"tgsigqueueinfo\": 50012, \"utimensat\": 749, \"vfork\": 599, \"umask\": 350, \"getres\": 12394, \"pselect6\": 43158, \"symlinkat\": 1, \"pipe\": 6, \"waitpid\": 1, \"getpgid\": 345, \"getcwd\": 685, \"getrusage\": 613, \"setattr\": 45, \"tkill\": 1374, \"memfd\": 13, \"add\": 308, \"watch\": 316, \"setresuid32\": 254, \"sendfile64\": 20, \"mknodat\": 157, \"msync\": 111, \"truncate\": 3, \"mlock\": 2264, \"munlock\": 2051, \"chdir\": 61, \"fsetxattr\": 63, \"fgetxattr\": 133, \"flistxattr\": 32, \"rm\": 8, \"open\": 58, \"getdents\": 4, \"getxattr\": 1, \"syslog\": 2}", "word_docs": "{\"tid\": 1475, \"recvfrom\": 1564, \"close\": 1909, \"ppoll\": 1980, \"faccessat\": 1739, \"sendto\": 1496, \"futex\": 1998, \"fcntl64\": 1664, \"sched\": 1506, \"gettid\": 1692, \"thread\": 1584, \"syscall\": 1976, \"area\": 1584, \"fstat64\": 1893, \"address\": 1475, \"mmap2\": 1928, \"munmap\": 1972, \"write\": 1760, \"clock\": 1997, \"sigtimedwait\": 1908, \"getpriority\": 1589, \"yield\": 1355, \"exit\": 1940, \"membarrier\": 1487, \"pread64\": 1556, \"dup\": 1570, \"pwait\": 1676, \"clone\": 1598, \"sigprocmask\": 1968, \"uname\": 1497, \"read\": 1982, \"getrandom\": 1568, \"set\": 1635, \"openat\": 1942, \"ctl\": 1473, \"writev\": 1862, \"getuid32\": 1906, \"mprotect\": 1744, \"setpriority\": 1773, \"prctl\": 1911, \"fstatat64\": 1822, \"madvise\": 1965, \"gettimeofday\": 1711, \"ioctl\": 1995, \"epoll\": 1676, \"gettime\": 1997, \"restart\": 1976, \"sigaltstack\": 1943, \"rt\": 1992, \"readlinkat\": 1198, \"timerfd\": 708, \"fsync\": 1124, \"recvmsg\": 833, \"sendmsg\": 1288, \"connect\": 1332, \"renameat\": 1205, \"geteuid32\": 894, \"ftruncate64\": 1089, \"eventfd2\": 867, \"settime\": 686, \"create1\": 864, \"statfs64\": 484, \"socket\": 1330, \"pwrite64\": 1055, \"pipe2\": 899, \"getsockname\": 909, \"fdatasync\": 1137, \"unlinkat\": 1244, \"mkdirat\": 780, \"nanosleep\": 719, \"getsockopt\": 1337, \"fchmodat\": 1174, \"setsockopt\": 1108, \"capget\": 287, \"tgkill\": 435, \"readv\": 410, \"llseek\": 866, \"getscheduler\": 536, \"process\": 409, \"setitimer\": 289, \"socketpair\": 697, \"sigreturn\": 667, \"mremap\": 683, \"dup3\": 831, \"execve\": 414, \"fstatfs64\": 655, \"create\": 262, \"getppid\": 328, \"getdents64\": 995, \"flock\": 732, \"lseek\": 826, \"getgid32\": 245, \"vm\": 409, \"getaffinity\": 367, \"sigaction\": 664, \"setsid\": 285, \"getparam\": 328, \"personality\": 393, \"ptrace\": 286, \"getpid\": 420, \"group\": 389, \"getegid32\": 254, \"ugetrlimit\": 403, \"kill\": 182, \"shutdown\": 594, \"setaffinity\": 138, \"getpeername\": 35, \"fchmod\": 206, \"sigsuspend\": 187, \"wait4\": 201, \"setpgid\": 16, \"mincore\": 111, \"bind\": 197, \"sysinfo\": 198, \"accept4\": 169, \"listen\": 166, \"inotify\": 20, \"init1\": 14, \"fchown32\": 23, \"setscheduler\": 28, \"get\": 46, \"min\": 42, \"priority\": 46, \"max\": 44, \"tgsigqueueinfo\": 70, \"utimensat\": 46, \"vfork\": 125, \"umask\": 70, \"getres\": 34, \"pselect6\": 102, \"waitpid\": 1, \"pipe\": 4, \"symlinkat\": 1, \"getpgid\": 57, \"getcwd\": 91, \"getrusage\": 46, \"setattr\": 28, \"tkill\": 54, \"memfd\": 5, \"add\": 17, \"watch\": 18, \"setresuid32\": 12, \"sendfile64\": 5, \"msync\": 5, \"mknodat\": 4, \"truncate\": 3, \"munlock\": 1, \"mlock\": 1, \"chdir\": 8, \"fgetxattr\": 14, \"fsetxattr\": 13, \"flistxattr\": 12, \"rm\": 4, \"getdents\": 1, \"open\": 2, \"getxattr\": 1, \"syslog\": 1}", "index_docs": "{\"69\": 1475, \"22\": 1564, \"19\": 1909, \"35\": 1980, \"40\": 1739, \"30\": 1496, \"7\": 1998, \"25\": 1664, \"20\": 1506, \"8\": 1692, \"61\": 1584, \"64\": 1976, \"62\": 1584, \"26\": 1893, \"70\": 1475, \"9\": 1928, \"10\": 1972, \"11\": 1760, \"2\": 1997, \"89\": 1908, \"45\": 1589, \"21\": 1355, \"65\": 1940, \"48\": 1487, \"37\": 1556, \"34\": 1570, \"15\": 1676, \"60\": 1598, \"5\": 1968, \"47\": 1497, \"6\": 1982, \"44\": 1568, \"52\": 1635, \"28\": 1942, \"50\": 1473, \"39\": 1862, \"24\": 1906, \"33\": 1744, \"66\": 1773, \"27\": 1911, \"29\": 1822, \"32\": 1965, \"12\": 1711, \"13\": 1995, \"14\": 1676, \"3\": 1997, \"63\": 1976, \"51\": 1943, \"4\": 1992, \"43\": 1198, \"86\": 708, \"84\": 1124, \"36\": 833, \"42\": 1288, \"54\": 1332, \"73\": 1205, \"67\": 894, \"56\": 1089, \"99\": 867, \"87\": 686, \"98\": 864, \"95\": 484, \"49\": 1330, \"38\": 1055, \"91\": 899, \"82\": 909, \"46\": 1137, \"72\": 1244, \"74\": 780, \"23\": 719, \"41\": 1337, \"71\": 1174, \"81\": 1108, \"131\": 287, \"85\": 435, \"16\": 410, \"31\": 866, \"77\": 536, \"17\": 409, \"121\": 289, \"94\": 697, \"78\": 667, \"76\": 683, \"90\": 831, \"102\": 414, \"79\": 655, \"119\": 262, \"113\": 328, \"68\": 995, \"97\": 732, \"57\": 826, \"108\": 245, \"18\": 409, \"112\": 367, \"58\": 664, \"132\": 285, \"80\": 328, \"103\": 393, \"75\": 286, \"53\": 420, \"110\": 389, \"107\": 254, \"116\": 403, \"136\": 182, \"96\": 594, \"100\": 138, \"125\": 35, \"124\": 206, \"104\": 187, \"109\": 201, \"149\": 16, \"114\": 111, \"92\": 197, \"88\": 198, \"101\": 169, \"137\": 166, \"128\": 20, \"148\": 14, \"93\": 23, \"141\": 28, \"122\": 46, \"135\": 42, \"123\": 46, \"134\": 44, \"55\": 70, \"115\": 46, \"120\": 125, \"126\": 70, \"83\": 34, \"59\": 102, \"157\": 1, \"152\": 4, \"156\": 1, \"127\": 57, \"117\": 91, \"118\": 46, \"145\": 28, \"111\": 54, \"150\": 5, \"130\": 17, \"129\": 18, \"133\": 12, \"147\": 5, \"140\": 5, \"138\": 4, \"154\": 3, \"106\": 1, \"105\": 1, \"143\": 8, \"139\": 14, \"142\": 13, \"146\": 12, \"151\": 4, \"153\": 1, \"144\": 2, \"158\": 1, \"155\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"clock\", \"3\": \"gettime\", \"4\": \"rt\", \"5\": \"sigprocmask\", \"6\": \"read\", \"7\": \"futex\", \"8\": \"gettid\", \"9\": \"mmap2\", \"10\": \"munmap\", \"11\": \"write\", \"12\": \"gettimeofday\", \"13\": \"ioctl\", \"14\": \"epoll\", \"15\": \"pwait\", \"16\": \"readv\", \"17\": \"process\", \"18\": \"vm\", \"19\": \"close\", \"20\": \"sched\", \"21\": \"yield\", \"22\": \"recvfrom\", \"23\": \"nanosleep\", \"24\": \"getuid32\", \"25\": \"fcntl64\", \"26\": \"fstat64\", \"27\": \"prctl\", \"28\": \"openat\", \"29\": \"fstatat64\", \"30\": \"sendto\", \"31\": \"llseek\", \"32\": \"madvise\", \"33\": \"mprotect\", \"34\": \"dup\", \"35\": \"ppoll\", \"36\": \"recvmsg\", \"37\": \"pread64\", \"38\": \"pwrite64\", \"39\": \"writev\", \"40\": \"faccessat\", \"41\": \"getsockopt\", \"42\": \"sendmsg\", \"43\": \"readlinkat\", \"44\": \"getrandom\", \"45\": \"getpriority\", \"46\": \"fdatasync\", \"47\": \"uname\", \"48\": \"membarrier\", \"49\": \"socket\", \"50\": \"ctl\", \"51\": \"sigaltstack\", \"52\": \"set\", \"53\": \"getpid\", \"54\": \"connect\", \"55\": \"tgsigqueueinfo\", \"56\": \"ftruncate64\", \"57\": \"lseek\", \"58\": \"sigaction\", \"59\": \"pselect6\", \"60\": \"clone\", \"61\": \"thread\", \"62\": \"area\", \"63\": \"restart\", \"64\": \"syscall\", \"65\": \"exit\", \"66\": \"setpriority\", \"67\": \"geteuid32\", \"68\": \"getdents64\", \"69\": \"tid\", \"70\": \"address\", \"71\": \"fchmodat\", \"72\": \"unlinkat\", \"73\": \"renameat\", \"74\": \"mkdirat\", \"75\": \"ptrace\", \"76\": \"mremap\", \"77\": \"getscheduler\", \"78\": \"sigreturn\", \"79\": \"fstatfs64\", \"80\": \"getparam\", \"81\": \"setsockopt\", \"82\": \"getsockname\", \"83\": \"getres\", \"84\": \"fsync\", \"85\": \"tgkill\", \"86\": \"timerfd\", \"87\": \"settime\", \"88\": \"sysinfo\", \"89\": \"sigtimedwait\", \"90\": \"dup3\", \"91\": \"pipe2\", \"92\": \"bind\", \"93\": \"fchown32\", \"94\": \"socketpair\", \"95\": \"statfs64\", \"96\": \"shutdown\", \"97\": \"flock\", \"98\": \"create1\", \"99\": \"eventfd2\", \"100\": \"setaffinity\", \"101\": \"accept4\", \"102\": \"execve\", \"103\": \"personality\", \"104\": \"sigsuspend\", \"105\": \"mlock\", \"106\": \"munlock\", \"107\": \"getegid32\", \"108\": \"getgid32\", \"109\": \"wait4\", \"110\": \"group\", \"111\": \"tkill\", \"112\": \"getaffinity\", \"113\": \"getppid\", \"114\": \"mincore\", \"115\": \"utimensat\", \"116\": \"ugetrlimit\", \"117\": \"getcwd\", \"118\": \"getrusage\", \"119\": \"create\", \"120\": \"vfork\", \"121\": \"setitimer\", \"122\": \"get\", \"123\": \"priority\", \"124\": \"fchmod\", \"125\": \"getpeername\", \"126\": \"umask\", \"127\": \"getpgid\", \"128\": \"inotify\", \"129\": \"watch\", \"130\": \"add\", \"131\": \"capget\", \"132\": \"setsid\", \"133\": \"setresuid32\", \"134\": \"max\", \"135\": \"min\", \"136\": \"kill\", \"137\": \"listen\", \"138\": \"mknodat\", \"139\": \"fgetxattr\", \"140\": \"msync\", \"141\": \"setscheduler\", \"142\": \"fsetxattr\", \"143\": \"chdir\", \"144\": \"open\", \"145\": \"setattr\", \"146\": \"flistxattr\", \"147\": \"sendfile64\", \"148\": \"init1\", \"149\": \"setpgid\", \"150\": \"memfd\", \"151\": \"rm\", \"152\": \"pipe\", \"153\": \"getdents\", \"154\": \"truncate\", \"155\": \"syslog\", \"156\": \"symlinkat\", \"157\": \"waitpid\", \"158\": \"getxattr\"}", "word_index": "{\"<OOV>\": 1, \"clock\": 2, \"gettime\": 3, \"rt\": 4, \"sigprocmask\": 5, \"read\": 6, \"futex\": 7, \"gettid\": 8, \"mmap2\": 9, \"munmap\": 10, \"write\": 11, \"gettimeofday\": 12, \"ioctl\": 13, \"epoll\": 14, \"pwait\": 15, \"readv\": 16, \"process\": 17, \"vm\": 18, \"close\": 19, \"sched\": 20, \"yield\": 21, \"recvfrom\": 22, \"nanosleep\": 23, \"getuid32\": 24, \"fcntl64\": 25, \"fstat64\": 26, \"prctl\": 27, \"openat\": 28, \"fstatat64\": 29, \"sendto\": 30, \"llseek\": 31, \"madvise\": 32, \"mprotect\": 33, \"dup\": 34, \"ppoll\": 35, \"recvmsg\": 36, \"pread64\": 37, \"pwrite64\": 38, \"writev\": 39, \"faccessat\": 40, \"getsockopt\": 41, \"sendmsg\": 42, \"readlinkat\": 43, \"getrandom\": 44, \"getpriority\": 45, \"fdatasync\": 46, \"uname\": 47, \"membarrier\": 48, \"socket\": 49, \"ctl\": 50, \"sigaltstack\": 51, \"set\": 52, \"getpid\": 53, \"connect\": 54, \"tgsigqueueinfo\": 55, \"ftruncate64\": 56, \"lseek\": 57, \"sigaction\": 58, \"pselect6\": 59, \"clone\": 60, \"thread\": 61, \"area\": 62, \"restart\": 63, \"syscall\": 64, \"exit\": 65, \"setpriority\": 66, \"geteuid32\": 67, \"getdents64\": 68, \"tid\": 69, \"address\": 70, \"fchmodat\": 71, \"unlinkat\": 72, \"renameat\": 73, \"mkdirat\": 74, \"ptrace\": 75, \"mremap\": 76, \"getscheduler\": 77, \"sigreturn\": 78, \"fstatfs64\": 79, \"getparam\": 80, \"setsockopt\": 81, \"getsockname\": 82, \"getres\": 83, \"fsync\": 84, \"tgkill\": 85, \"timerfd\": 86, \"settime\": 87, \"sysinfo\": 88, \"sigtimedwait\": 89, \"dup3\": 90, \"pipe2\": 91, \"bind\": 92, \"fchown32\": 93, \"socketpair\": 94, \"statfs64\": 95, \"shutdown\": 96, \"flock\": 97, \"create1\": 98, \"eventfd2\": 99, \"setaffinity\": 100, \"accept4\": 101, \"execve\": 102, \"personality\": 103, \"sigsuspend\": 104, \"mlock\": 105, \"munlock\": 106, \"getegid32\": 107, \"getgid32\": 108, \"wait4\": 109, \"group\": 110, \"tkill\": 111, \"getaffinity\": 112, \"getppid\": 113, \"mincore\": 114, \"utimensat\": 115, \"ugetrlimit\": 116, \"getcwd\": 117, \"getrusage\": 118, \"create\": 119, \"vfork\": 120, \"setitimer\": 121, \"get\": 122, \"priority\": 123, \"fchmod\": 124, \"getpeername\": 125, \"umask\": 126, \"getpgid\": 127, \"inotify\": 128, \"watch\": 129, \"add\": 130, \"capget\": 131, \"setsid\": 132, \"setresuid32\": 133, \"max\": 134, \"min\": 135, \"kill\": 136, \"listen\": 137, \"mknodat\": 138, \"fgetxattr\": 139, \"msync\": 140, \"setscheduler\": 141, \"fsetxattr\": 142, \"chdir\": 143, \"open\": 144, \"setattr\": 145, \"flistxattr\": 146, \"sendfile64\": 147, \"init1\": 148, \"setpgid\": 149, \"memfd\": 150, \"rm\": 151, \"pipe\": 152, \"getdents\": 153, \"truncate\": 154, \"syslog\": 155, \"symlinkat\": 156, \"waitpid\": 157, \"getxattr\": 158}"}}